app/views/posts/index.html.erb

        <td class="post-body"><%= post.body %></td>
        <td class="post-tags"><%= post.tags.join(', ') %></td>
---
SELECT  "posts".* FROM "posts" INNER JOIN "posts_tags" ON "posts"."id" = "posts_tags"."post_id" WHERE "posts_tags"."tag_id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["tag_id", nil]]
SELECT name, COUNT(tag_id) AS tagid FROM "tags" INNER JOIN "posts_tags" ON "posts_tags"."tag_id" = "tags"."id" INNER JOIN "posts" ON "posts"."id" = "posts_tags"."post_id" GROUP BY tag_id  ORDER BY tagid DESC