app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"  ORDER BY "posts"."updated_at" DESC
SELECT "posts"."id" FROM "posts" INNER JOIN "roles" ON "roles".resource_type IN ('Post') AND
SELECT "tags"."name" FROM "tags" INNER JOIN "posts_tags" ON "posts_tags"."tag_id" = "tags"."id" INNER JOIN "posts" ON "posts"."id" = "posts_tags"."post_id" GROUP BY tags.name, tag_id  ORDER BY COUNT(tag_id) DESC
---
  def index
    @posts = Post.all.order(updated_at: :desc)
    @tags = Tag.joins(:posts).select('name').group('tags.name, tag_id').order('COUNT(tag_id)').reverse_order

INSERT INTO "posts" ("author", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "Author"], ["title", "Moj krasny program"], ["body", "sssddfd"], ["created_at", "2015-12-12 12:41:03.282764"], ["updated_at", "2015-12-12 12:41:03.282764"]]
---
  def create
    @post = Post.new(post_params)
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "HW success"], ["body", "Mozme ist na pivo."], ["updated_at", "2015-11-30 18:55:00.224562"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

SELECT name, COUNT(posts_tags.tag_id) AS count FROM "tags" INNER JOIN "posts_tags" "tags_posts_tags_join" ON "tags_posts_tags_join"."tag_id" = "tags"."id" INNER JOIN "posts" ON "posts"."id" = "tags_posts_tags_join"."post_id" INNER JOIN "posts_tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "posts_tags"."post_id" = $1 GROUP BY tags.name, posts_tags.tag_id  [["post_id", 1]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT 1  [["name", "vavs"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
DELETE FROM "posts_tags" WHERE "posts_tags"."tag_id" = ?  [["tag_id", 7]]
DELETE FROM "tags" WHERE "tags"."id" = ?  [["id", 7]]
---
  def destroy
    array_of_tags = @post.tags.joins(:posts).select('name, COUNT(posts_tags.tag_id) AS count')
      .group('tags.name, posts_tags.tag_id')
    array_of_tags.each do |tag|
      tag.destroy if tag.count <= 1

SELECT "posts".* FROM "posts" INNER JOIN "posts_tags" ON "posts_tags"."post_id" = "posts"."id" INNER JOIN "tags" ON "tags"."id" = "posts_tags"."tag_id" WHERE "tags"."name" = '10'  ORDER BY "posts"."updated_at" DESC
SELECT "tags"."name" FROM "tags" INNER JOIN "posts_tags" ON "posts_tags"."tag_id" = "tags"."id" INNER JOIN "posts" ON "posts"."id" = "posts_tags"."post_id" GROUP BY tags.name, tag_id  ORDER BY COUNT(tag_id) DESC
---
  def filter
    @posts = Post.all.joins(:tags).where(:tags => { :name => params[:name] }).order(updated_at: :desc)
    @tags = Tag.all.joins(:posts).select('name').group('tags.name, tag_id').order('COUNT(tag_id)').reverse_order

SELECT  "posts".* FROM "posts" WHERE "posts"."created_at" = ? LIMIT 1  [["created_at", "2015-11-28 16:16:33.345707"]]
---
  def set_post
    @post = Post.find(params[:id])